Show / Hide Table of Contents
Class MaterialStrengthProperty
Class defines the strength of material acc. to materieal thickness
Inheritance
System.Object
OpenObject
MaterialStrengthProperty
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("IdeaRS.MprlModel.Material.MaterialStrengthProperty,CI.BasicTypes")]
public class MaterialStrengthProperty : OpenObject
Properties
Improve this Doc   View Source
List
Collection of material strength levels
Declaration
public List<MaterialStrength> List { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<MaterialStrength>
 Improve this Doc
 View Source